bit-finance/Reports/бит_кзн_ПлатежныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_кзн_ПлатежныйКалендарь</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

bit-finance/Enums/бит_кзн_РежимОтображенияОстатковДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_кзн_РежимОтображенияОстатковДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УправленческаяВыписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДанныеРегУчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Reports/бит_кзн_ПлатежныйКалендарь/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОписаниеПеременных

Перем мНастройкиИзмерений Экспорт; // Хранит настройки дополнительных измерений.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СписокПараметровНаФорме = Новый СписокЗначений;
	Отчеты.бит_кзн_ПлатежныйКалендарь.ЗаполнитьДополнительныеСписки(СписокПараметровНаФорме);
	
	Для каждого ЭлементСписка Из СписокПараметровНаФорме Цикл
		ИмяПараметра = ЭлементСписка.Значение;
		бит_ОтчетыСервер.УстановитьЗначениеПараметраКомпоновщика(КомпоновщикНастроек, 
			ЭтотОбъект[ИмяПараметра], ИмяПараметра);
	КонецЦикла;  	 
	
	РежимОстатков = ?(Константы.бит_кзн_РежимОтображенияОстатковДС.Получить() = Перечисления.бит_кзн_РежимОтображенияОстатковДС.УправленческаяВыписка, 1, 0);
	бит_ОтчетыСервер.УстановитьЗначениеПараметраКомпоновщика(КомпоновщикНастроек, РежимОстатков, "РежимОстатков");
															 
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(
		"ВалютаУпр", Константы.бит_ВалютаУправленческогоУчета.Получить());

	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(
		"ВалютаРеглУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	
КонецПроцедуры // ПриКомпоновкеРезультата()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Период.ДатаНачала < НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя()) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,"КОРРЕКТНОСТЬ", 
			НСтр("ru='Начало периода';en='Period Start'"),,,
			НСтр("ru='Отчет не предназначен для анализа прошедших периодов.';
				 |en='The report is not designed to analyze past periods.'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Отчет.Период.ДатаНачала",, Отказ); 
	КонецЕсли; 

	бит_ОтчетыСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

мНастройкиИзмерений = бит_МеханизмДопИзмеренийПовтИсп.НастройкиДополнительныхИзмерений();
бит_МеханизмДопИзмерений.НастроитьПоляДополнительныхИзмеренийВСКД(СхемаКомпоновкиДанных, "НаборДанных1");
					
бит_ОтчетыСервер.УстановитьСтандартноеВыражениеПредставленияПоляПериод(СхемаКомпоновкиДанных, "НаборДанных1", "Период");

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
